Praktinis/app/controllers/admin_controller.rb

  def admin_page
    @categories = Category.order(:title)
---
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`title` ASC

  def user_display
    @users = User.all
---
SELECT `users`.* FROM `users`

  def query_users_action
    users = User.find_by(id: params[:id])
    raktazodis = params[:raktazodis]
    users = User.all
    @found_users = []
    if raktazodis.nil?
      @found_users = User.all
    else
      (0..users.length - 1).each do |i|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `users`.* FROM `users`

  def delete_user_action
    msg = params[:id]
    user = User.find_by(id: msg)
    user_to_delete = msg
    user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 6

  def item_display
    @category_list = Category.all
    @products = Product.all
---
SELECT `categories`.* FROM `categories`
SELECT `products`.* FROM `products`

  def query_items_action
    category = Category.find_by(id: params[:pasirinkta_kategorija])
    raktazodis = params[:raktazodis]
    products = Product.all
    @found_products = []
    if category.nil?
      if raktazodis.nil?
        @found_products = Product.all
      else
        (0..products.length - 1).each do |i|
          @found_products.append(products[i]) if products[i].title.include? raktazodis
        end
      end
    elsif raktazodis == ''
      (0..products.length - 1).each do |i|
        @found_products.append(products[i]) if products[i].category_id == category.id
      end
    else
      (0..products.length - 1).each do |i|
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 0 LIMIT 1
SELECT `products`.* FROM `products`

  def item_update
    @msg = params[:message]
    @category_list = Category.all
    @product_id = Product.find_by(id: @msg)
    @product_category = Category.find_by(id: @product_id.category_id)
---
SELECT `categories`.* FROM `categories`
SELECT `products`.* FROM `products` WHERE `products`.`id` = 8 LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1

  def update_item_to_db
    item = Product.find_by(id: params[:item_id])
    response = item.update_product(params[:item_id], params[:title], params[:category_id], params[:price],
                                   params[:description])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL LIMIT 1
UPDATE `products` SET `products`.`title` = 'SAMSUNG', `products`.`description` = '100', `products`.`price` = 5, `products`.`category_id` = NULL WHERE `products`.`id` = 9

  def delete_item_action
    msg = params[:id]
    item = Product.find_by(id: msg)
    item_to_delete = msg
    item.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1

  def item_new
    @msg = params[:message]
    @products = Product.all
    @category_list = Category.all
    @product_id = Product.find_by(id: @msg)
---
SELECT `categories`.* FROM `categories`
SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL LIMIT 1