Praktinis/app/controllers/home_controller.rb

  def index
    @categories = Category.order(:title)
---
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`title` ASC