Praktinis/app/controllers/products_controller.rb

  def index
    @category = Category.find(params[:category_id])
    @products = @category.products.order(:title)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 6 LIMIT 1
SELECT `products`.* FROM `products` INNER JOIN `product_categories` ON `products`.`id` = `product_categories`.`product_id` WHERE `product_categories`.`category_id` = 1 ORDER BY `products`.`title` ASC