Praktinis/app/controllers/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'admin' LIMIT 1
---
  def login_user
    user = User.new
    response = user.authentification(params[:username], params[:password]) # autentifikuoja, jei rastas, proceed
    if response.nil?
      redirect_to controller: 'user', action: 'login', message: 'nil'
    elsif User.find_by(user_type: response['user_type'].to_s).user_type == 'admin'

SELECT `categories`.* FROM `categories` ORDER BY `categories`.`title` ASC
---
  def user_page
    @categories = Category.order(:title)

SELECT `orders`.* FROM `orders`
---
  def user_cart
    @orders = Order.all