Praktinis/app/views/admin/item_display.html.erb

                    <div class="inline">
                     <p class="data_allign_left"><%=Category.find_by(id: @products[j].category_id).title%> </p>
                        <p class="data_allign_left"><%="Produkto ID: " + Product.find_by(id: @products[j].id).id.to_s%> </p>
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1