Praktinis/app/views/admin/user_display.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
                    <div class="inline">
                        <p class="data_allign_left"><%="Naudotojo ID: " + User.find_by(id: @users[j].id).id.to_s%> </p>