Praktinis/app/models/product.rb

  def update_product(item_id, title, category_id, price, description)
    produktas = Product.find_by(id: item_id)
    produktas.update_columns(title: title, description: description, price: price, category_id: category_id)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL LIMIT 1
UPDATE `products` SET `products`.`title` = 'SAMSUNG', `products`.`description` = '100', `products`.`price` = 5, `products`.`category_id` = NULL WHERE `products`.`id` = 9

  def new_product(title, category_id, price, description)
    user = Product.new(title: title, description: description, price: price, category_id: category_id)
    user.save
---
INSERT INTO `products` (`title`, `description`, `price`, `category_id`) VALUES ('GIGABYTE GeForce GT 730 2GB GDDR5 LP', 'GeForce GT 730', 74, 2)