Praktinis/app/models/user.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'karce' AND `users`.`password` = '123456' LIMIT 1
---
  def authentification(given_username, given_password)
    user = User.find_by(username: given_username, password: given_password)

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'vains' LIMIT 1
SELECT COUNT({:id=>true}) FROM `users`
INSERT INTO `users` (`id`, `username`, `password`, `user_type`, `created_at`, `updated_at`) VALUES (5, 'asdf', '123456', '', '2021-02-24 13:13:45.045230', '2021-02-24 13:13:45.045230')
---
  def register_user(username, password, password2)
    user = User.find_by(username: username)
    if !user.nil?
      'Toks naudotojas jau egzistuoja'
    elsif password == password2
      usercount = User.count
      user = User.new(id: usercount + 1, username: username, password: password, user_type: '')
      user.save 'Naudotojas issaugotas'