Praktinis/app/views/layouts/application.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = 'admin' LIMIT 1
---
  <%if session[:user]!=nil then%>
    <%if User.find_by(user_type: session[:user]['user_type'].to_s).user_type=="admin" then%>

SELECT `users`.* FROM `users` WHERE `users`.`user_type` = '' LIMIT 1
---
    <%else%>
      <%if User.find_by(user_type: session[:user]['user_type'].to_s).user_type=="" then%>